# Pc_price = 10000
# discount = 10                # % discount #ფაზდაკლება
# avalaible_money = 9600

#რამდენი ლარი დაგვრჩა?

# "*" ფიფქი ნიშნავს გამრავლებას პროგრამისტობაში


# "/" დახრილი ხაზი პროგრამისტობაში გაყოფას ნიშნავს



#print(avalaible_money - Pc_price*(100 - discount)/100)



# Pc_price = 9000

# discount = 15 

# avalaible_money = 8700

# print(avalaible_money - Pc_price*(100 - discount)/100)


# print(15 / 2)
#                         #1 დახრილი ხაზი გაყოფს ზუზტად შუაზე და 2 დახრილი ხაზი ჩამოჭრის განაყოფს
# print(15 // 2)



# print(23 / 2)

# print(23 // 2)


# print(23 % 5)    # % თუ დავწერთ რიცხვი გაიყოფა კონრეტულ რიცხვზე და ჩაიწერება დარჩენილი ნაშთი
#                  #თუ ნაშთი არიქნება დაიწერება 0

# print(42 % 5)    #42 / 5 = 8.2 = 2

# print(42 / 5)