# i = 0
# while i < 20:
#     print(i)
#     i += 4

    #თითოეულ იტერაციაზე ვპრინტავთ საინტერაციო ცვლად "i"

    #თითოეულ იტერაციაზე საიტერაციო ცვლა იზრდება 4 ით


# numberof_cyrcles = 3   #იქმნება ლიმიტის ცვლადი

# cycle_count = 0        #საიტერაციო ცვლადი

# while cycle_count < numberof_cyrcles:     #სანამ საიტრაციო ცვლადი ნაკლებია ლიმიტის ცვლადზე ანუ ნოლი სანამ ნაკლებია 3 ზე
#     print("cycle", cycle_count + 1)       #დაიპრინტოს 
 
#     print("wake up")
#     print("sleep")


#     print("code")
#     print("eat")
#     print("sleep")

#     cycle_count += 1

#     print("finished")

          #sum არის ჯამი



# sum = 0               #შევქმენით ცვლადი (ჯამი) მისი მნიშველი 0
# i = 100               #შეიქმნა საიტერაციო ცვლადი
# while i <= 100:       #შეიქმნა ციკლი რომლის ლიმიტი i ნაკლებია ან ტოლია 100 ის
#     sum += i          #ჯამს მიემატება i  საიტერაციო ცვლადი 
#     i += 2            #იზრდება 2ით რათა მივიღოთ ლუწი რიცხვები 

#     print(sum)        #დაიპრინტება ჯამი




# "break" არის ციკლისთვის მუხრუჭი 


# "continue" არის გაგრძელება ამ შემთხვევაში ნიშნავს დასკიპვას 

    