# #ეს არის კომენტარი და ამაზე რაც არუნდა დავწეროთ პროგრამა დააიგნორებს 

# #ტექსტის მთლიანად მონიშვნის შემდეგ ctrl+? დააკომენტარებს

# print("hello world") #ბრჭალებს ეწოდება string (str) და იქმნება 
# #მონაცემთა ტიპი

# #syntax არის ენის წესი

# #ტერმინალი არის გარემო სადაც კოდის შედეგს ვიღებთ 

# #ტერმინალში გამოდის ყველაფერი 1 სახით

# #output არის შედეგი იმისა თუ რა გამოიტანა

# #კოდის წაშლის შემთხვევაში ctrl+z აბრუნებს წაშლილ კოდს

# print(5) #რიცხვს ვეძახით integer (int) 

# print("5") #ეს არის string

# #print(5 + "5") #მათ შორის არითმეტიკული ოპერაცია ვერ შედგება 

# #Type errors არის ტიპიური ერორი

# #პლიუსი არ შეიძლება "int" "str" შორის

# #ხშირ შემთხვევაში სხვადასხვა ტიპის მონაცემებში პლიუსი არ გამოდის

# print(5 + int("5"))  #არსებობს ტიპებს შორის გარდაქმნა 
# #ანუ "5" გადავაქციეთ int რიცხვად

# print("dato gafrindashvils uyvars" + " eto" + " pilishvili")

# #ბრჭყალების შემდეგ სფეისი ტერმინალში ყოფს სიტყვებს




from turtle import*

#ვხატავთ სახლს კოდით

shape("turtle")

speed(2000)       #ეს არის ნახაზის დახაზვის სიჩქარე რაც უფრო მეტია სიჩქარე მით მალე დაიხაზება


width(7)         #ეს არის ბრძანება რომელიც ნახაზს აძლევს სისქეს ამ შემთვევაში "7" არის ნახაზის სისქე პიქსელში


color("purple")         #ეს არის ბრძანება რომელიც ნახაზს აძლევს ფერს

begin_fill()             #ეს არის ბრძანება სადაც ვიწყებთ ფერებით ამოვსებას
#კვადრატის დახაზვა

forward(200)          #აქ "200" ვეძახით პარამეტრის მნიშნელობას და "forward" არის წინწასვლა
left(90)        #ის ფუნქციას გადაეცემა  რიცხვის ტიპის ფუნქცია ანუ ინტეჯერი და ეს არის გრადუსი და რამდენი გრადუსით მოუხვიოს

forward(200)          
left(90) 

forward(200)          
left(90)

forward(200)          
left(90)

end_fill()                #ეს არის ბრძანება სადაც ვასრულებთ ამოვსებას


#კვადრატის დახაზვის დამთავრება


#კარების დახაზვა




forward(70) 

color("yellow")

begin_fill()


left(90)


forward(100)      #height of the door
right(90)

forward(60)
right(90)

forward(100)

end_fill()


#კარების დახაზვის დამთავრება

penup()                  #ეს არის ბრძანება იმის თუ რა კორდინანტიდან გვინდა გავაგრძელოთ დახაზვა.        საიდანაც დახაზვა იწყება იმ ადგილის კორდინანტი 0, 0 არის
goto(200, 200)                 #აქ მივუთითებთ იმ კორდინანტებს საიდანაც გვინდა ნახაზის გაგრძელება
pendown()                #ეს არის ბრძანება რო კალამი ჩამოვუშვათ ისევ დასახატად




#ვხატავთ სახურავს


color("red")

begin_fill()       



right(150)
forward(200)

left(120)
forward(200)

end_fill()    

#ფანჯრები


penup()
goto(200,180)
pendown()

right(60)
forward(40)

left(90)
forward(40)

left(90)
forward(40)

left(90)
forward(40)

penup()
goto(0, 0)

forward(180)

pendown()

right(90)
forward(40)

right(90)
forward(40)

right(90)
forward(40)

right(90)
forward(40)

penup()
goto(0, 0)






exitonclick()  #ეს არის გრაფიკული ნახაზისთვის და გრაფიკული ნახაზი გაითიშება მაშინ როცა ჩვენ მოგვინდება





